app/Http/Controllers/OpenAi/OpenAiController.php

select * from "messages"
---
    public function stopEventListener(Chat $chat)
    {
        $id = $chat->id;
        $prompt_tokens = 0;
        $count_message = env('count_message');
        if (session()->get('econom')) $count_message = 1;