app/Http/Controllers/OpenAi/OpenAiController.php

    public function send__message(Request $request)
    {
        $message = new Message;
        $message->message = $request->message;
        $message->chat_id = $request->chat_id;
        $message->save();
---
insert into "messages" ("message", "chat_id", "updated_at", "created_at") values ('Как дела?', '1', '2023-04-14 12:39:45', '2023-04-14 12:39:45') returning "id"

    public function event__stream()
    {
        $results = Message::where('chat_id', 1)->orderByDesc('id')->take(2)->get()->sortBy("id");
        if (empty($results)) {
            $history[] = array("role" => "system", "content" => "You are a helpful assistant.");
        }

        foreach ($results as $result) {
            if ($result->is_bot) $history[] = ["role" => 'assistant', "content" => $result->message];
            if (!$result->is_bot) $history[] = ["role" => 'user', "content" => $result->message];
        }

        $opts = [
            'model' => 'gpt-3.5-turbo',
            'messages' => $history,
            'temperature' => 1.0,
            'max_tokens' => 3000,
            'frequency_penalty' => 0,
            'presence_penalty' => 0
        ];
        $open_ai = new OpenAi(env('open_ai_key'));
        $chat = $open_ai->chat($opts);
        $d = json_decode($chat);
        Debugbar::log($chat);
        $message = new Message;
        $message->message = $d->choices[0]->message->content;
        $message->chat_id = 1;
        $message->is_bot = true;
        $message->save();
---
select * from "messages" where "chat_id" = 1 order by "id" desc limit 2
insert into "messages" ("message", "chat_id", "is_bot", "updated_at", "created_at") values ('Я - AI-ассистент. А вы как зовут?', 1, 1, '2023-04-14 19:50:30', '2023-04-14 19:50:30') returning "id"