@extends('layouts.index', ["show" => true])
@section('content')
    <div class="mainWrapper">
        <section class="msger">
            <header class="msger-header">
                <div class="msger-header-title">
                    <i class="fas fa-comment-alt"></i> ChatGPT
                    &nbsp;| ID: <input type="text" id="id" hidden> <span class="id_session"></span>
                </div>
                <!--Удаление истории чата-->
                <div class="msger-header-options" style="display:none;">
                    <button id="delete-button">Delete History</button>
                </div>
            </header>

            <main class="msger-chat">
                <!--Плашка в начале чата-->
                @include('components.message')
                <!--Кнопка скролла вниз-->
            </main>
            <div class="messageInput">
                <!--Токены, которые пользователь слил в определенном чате-->
                <div class="tokens_chat">
                    <button id="openPrompts">
                        {{__("openPrompts")}}
                    </button>
                    <div class="tokensSpent">
                        @include('components.tokens_in_chat')
                    </div>
                </div>
                <form class="msger-inputarea">
                    @csrf
                    <input type="hidden" id="chat_id" name="chat_id" value="{{ $chat->id  }}">
                    <input type="hidden" id="user_id" name="user_id" value="{{ Auth()->id() }}">
                    @if (Auth::user()->tokens <= 0)
                        <textarea class="msger-input" placeholder="Enter your message..." required disabled></textarea>
                    @else
                        <textarea class="msger-input" placeholder="Enter your message..." required></textarea>
                        <button type="submit" class="msger-send-btn">
                            <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path fill-rule="evenodd" clip-rule="evenodd" d="M13 15.8379L11.144 10.2709L16.712 4.70193L13 15.8379ZM15.298 3.28793L9.73 8.85593L4.162 6.99993L15.298 3.28793ZM19.99 0.94793C19.985 0.85493 19.968 0.76493 19.937 0.67793C19.927 0.64693 19.916 0.61693 19.902 0.58693C19.854 0.47993 19.793 0.37893 19.707 0.29293C19.621 0.20693 19.52 0.14593 19.412 0.0979297C19.383 0.0839297 19.354 0.0729297 19.323 0.0629297C19.234 0.0319297 19.143 0.0139297 19.048 0.00892969C19.026 0.00792969 19.006 0.00292969 18.983 0.00292969C18.883 0.00492969 18.782 0.0189297 18.684 0.0509297L0.684 6.05093C0.275 6.18793 0 6.56893 0 6.99993C0 7.43093 0.275 7.81293 0.684 7.94893L9.209 10.7909L12.052 19.3169C12.188 19.7249 12.569 19.9999 13 19.9999C13.431 19.9999 13.812 19.7249 13.948 19.3169L19.948 1.31693C19.98 1.21793 19.995 1.11793 19.996 1.01793C19.997 0.99393 19.991 0.97193 19.99 0.94793V0.94793Z" fill="white"/>
                            </svg>
                        </button>
                    @endif

                </form>
            </div>
        </section>
    </div>
@endsection
@section('script')
    <!--Попап библиотеки подсказок-->
    <div class="popup" id="popup-library">
        <div class="popupWrapper"></div>
        <div class="popupContent">
            <div class="popup-inner">
                <h2>
                    Библиотека подсказок
                </h2>
                <div class="prompts-category">
                    @foreach($prompts_category as $prompt)
                        <button class="tablink-library" onclick="promptsBlock({{ $prompt->id }})" style="background-color: {{ $prompt->main_background_color }}; color: {{ $prompt->main_color }}">
                            {!! $prompt->main_image !!}
                            {{ $prompt->title }}
                        </button>
                    @endforeach
                    <button class="tablink-library" onclick="promptsBlock(3)" style="background-color: #102522; color: #22C55E">
                        <svg class="svgPath" width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_47_1595)"><path d="M16.0417 1.75684C15.0095 1.77289 13.9998 2.06103 13.1146 2.59217C12.2294 3.1233 11.5 3.87862 11 4.78184C10.5001 3.87862 9.77073 3.1233 8.88551 2.59217C8.00029 2.06103 6.99059 1.77289 5.95838 1.75684C4.31291 1.82833 2.76261 2.54815 1.64618 3.75905C0.529748 4.96995 -0.0620615 6.57348 4.31468e-05 8.21934C4.31468e-05 12.3874 4.38721 16.9396 8.06671 20.026C8.88824 20.7164 9.92695 21.0949 11 21.0949C12.0731 21.0949 13.1118 20.7164 13.9334 20.026C17.6129 16.9396 22 12.3874 22 8.21934C22.0621 6.57348 21.4703 4.96995 20.3539 3.75905C19.2375 2.54815 17.6872 1.82833 16.0417 1.75684ZM12.7555 18.6235C12.2641 19.0373 11.6424 19.2642 11 19.2642C10.3577 19.2642 9.73598 19.0373 9.24463 18.6235C4.53479 14.6718 1.83338 10.8804 1.83338 8.21934C1.77071 7.05949 2.16921 5.92192 2.94196 5.05473C3.71471 4.18753 4.79901 3.66107 5.95838 3.59017C7.11775 3.66107 8.20205 4.18753 8.97479 5.05473C9.74754 5.92192 10.146 7.05949 10.0834 8.21934C10.0834 8.46245 10.18 8.69561 10.3519 8.86752C10.5238 9.03943 10.7569 9.136 11 9.136C11.2432 9.136 11.4763 9.03943 11.6482 8.86752C11.8201 8.69561 11.9167 8.46245 11.9167 8.21934C11.854 7.05949 12.2525 5.92192 13.0253 5.05473C13.798 4.18753 14.8823 3.66107 16.0417 3.59017C17.2011 3.66107 18.2854 4.18753 19.0581 5.05473C19.8309 5.92192 20.2294 7.05949 20.1667 8.21934C20.1667 10.8804 17.4653 14.6718 12.7555 18.6198V18.6235Z" fill="#22C55E"></path></g><defs><clipPath id="clip0_47_1595"><rect width="22" height="22" fill="white"></rect></clipPath></defs></svg>
                        Здоровье
                    </button>
                    <button class="tablink-library" onclick="promptsBlock(4)" style="background-color: #25181F; color: #EF4444">
                        <svg class="svgPath" width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_47_1599)"><path d="M10.9991 11C11.7243 11 12.4332 10.785 13.0362 10.3821C13.6391 9.97916 14.1091 9.4065 14.3866 8.73651C14.6642 8.06651 14.7368 7.32927 14.5953 6.618C14.4538 5.90674 14.1046 5.2534 13.5918 4.74061C13.079 4.22782 12.4257 3.8786 11.7144 3.73712C11.0031 3.59564 10.2659 3.66825 9.5959 3.94578C8.92591 4.2233 8.35325 4.69326 7.95035 5.29624C7.54746 5.89922 7.33241 6.60814 7.33241 7.33333C7.33241 8.30579 7.71872 9.23843 8.40635 9.92606C9.09398 10.6137 10.0266 11 10.9991 11ZM10.9991 5.5C11.3617 5.5 11.7161 5.60752 12.0176 5.80897C12.3191 6.01042 12.5541 6.29675 12.6929 6.63175C12.8316 6.96674 12.8679 7.33537 12.7972 7.691C12.7264 8.04663 12.5518 8.3733 12.2954 8.6297C12.039 8.88609 11.7124 9.0607 11.3567 9.13144C11.0011 9.20218 10.6325 9.16587 10.2975 9.02711C9.96249 8.88835 9.67616 8.65337 9.47471 8.35188C9.27327 8.05039 9.16574 7.69593 9.16574 7.33333C9.16574 6.8471 9.3589 6.38079 9.70271 6.03697C10.0465 5.69315 10.5128 5.5 10.9991 5.5ZM18.9374 8.39392L18.2783 8.17483C18.3969 7.1481 18.2972 6.10788 17.9855 5.12241C17.6739 4.13694 17.1575 3.22847 16.4702 2.45657C15.7829 1.68467 14.9401 1.06678 13.9972 0.643421C13.0544 0.220062 12.0326 0.000795191 10.9991 0C9.95202 0.000404222 8.91721 0.22522 7.96437 0.659299C7.01154 1.09338 6.1628 1.72664 5.47535 2.51641C4.78791 3.30618 4.27772 4.23413 3.97916 5.23771C3.6806 6.2413 3.60061 7.29722 3.74458 8.33433C2.86736 8.4979 2.05619 8.91176 1.40891 9.526C0.960817 9.95202 0.604597 10.4652 0.362146 11.0339C0.119696 11.6027 -0.00385982 12.2151 -0.000925498 12.8333V16.5688C0.00100097 17.56 0.323384 18.524 0.918116 19.317C1.51285 20.1099 2.34804 20.6894 3.29907 20.9688L5.92991 21.7938C6.3718 21.9313 6.83203 22.0008 7.29483 22C7.71465 21.9995 8.13247 21.9421 8.53691 21.8295L13.8352 20.262C14.3072 20.1332 14.8052 20.1332 15.2772 20.262L17.4652 20.9953C18.0045 21.1266 18.5666 21.1337 19.109 21.0162C19.6514 20.8986 20.1601 20.6595 20.5966 20.3167C21.0332 19.974 21.3862 19.5366 21.6292 19.0376C21.8721 18.5386 21.9986 17.9909 21.9991 17.4359V12.716C21.997 11.7676 21.7016 10.8431 21.1535 10.0692C20.6054 9.29523 19.8313 8.70975 18.9374 8.393V8.39392ZM7.11058 3.4485C7.62048 2.93653 8.22646 2.5303 8.89375 2.2531C9.56104 1.97591 10.2765 1.83322 10.9991 1.83322C11.7216 1.83322 12.4371 1.97591 13.1044 2.2531C13.7717 2.5303 14.3777 2.93653 14.8876 3.4485C15.9162 4.48355 16.4944 5.883 16.4963 7.34226C16.4982 8.80152 15.9236 10.2025 14.8977 11.2402L11.6407 14.4073C11.4708 14.5739 11.2422 14.6673 11.0041 14.6673C10.7661 14.6673 10.5375 14.5739 10.3675 14.4073L7.11058 11.2539C6.07976 10.2166 5.50119 8.8136 5.50119 7.35121C5.50119 5.88881 6.07976 4.48581 7.11058 3.4485V3.4485ZM20.1657 17.4359C20.1663 17.7136 20.1035 17.9877 19.9822 18.2374C19.8608 18.4871 19.6841 18.7058 19.4654 18.8769C19.2588 19.043 19.0181 19.1616 18.7605 19.2242C18.5029 19.2867 18.2347 19.2918 17.9749 19.239L15.8253 18.5167C15.0122 18.2831 14.1505 18.278 13.3347 18.502L8.03274 20.0677C7.52333 20.2082 6.98422 20.199 6.47991 20.0411L3.82708 19.2161C3.25292 19.0501 2.74812 18.7023 2.38846 18.2249C2.02879 17.7476 1.83368 17.1664 1.83241 16.5688V12.8333C1.83035 12.4628 1.9041 12.0958 2.04913 11.7548C2.19416 11.4138 2.4074 11.1061 2.67574 10.8506C3.09581 10.4502 3.63092 10.1918 4.20566 10.1118C4.57517 11.0277 5.12542 11.8597 5.82358 12.5583L9.09333 15.7236C9.60438 16.224 10.2912 16.5042 11.0064 16.5042C11.7217 16.5042 12.4084 16.224 12.9195 15.7236L16.1856 12.5492C16.9168 11.8149 17.4834 10.9334 17.8475 9.96325L18.3397 10.1264C18.8736 10.3177 19.3354 10.669 19.6622 11.1325C19.989 11.5959 20.1648 12.1489 20.1657 12.716V17.4359Z" fill="#EF4444"></path></g><defs><clipPath id="clip0_47_1599"><rect width="22" height="22" fill="white"></rect></clipPath></defs></svg>
                        Путешествия
                    </button>
                    <button class="tablink-library" onclick="promptsBlock(5)" style="background-color: #0E242E; color: #06B6D4">
                        <svg class="svgPath" width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_47_1602)"><path d="M21.0303 6.26717L19.0301 4.26609L19.8982 3.39801C19.9857 3.31345 20.0556 3.2123 20.1036 3.10046C20.1516 2.98862 20.1769 2.86834 20.178 2.74662C20.179 2.62491 20.1559 2.5042 20.1098 2.39155C20.0637 2.27889 19.9956 2.17655 19.9095 2.09048C19.8235 2.00441 19.7211 1.93634 19.6085 1.89025C19.4958 1.84416 19.3751 1.82097 19.2534 1.82203C19.1317 1.82308 19.0114 1.84837 18.8996 1.89641C18.7877 1.94446 18.6866 2.01429 18.602 2.10184L17.7339 2.96992L15.7328 0.969757C15.1021 0.368719 14.2643 0.0334473 13.3931 0.0334473C12.5218 0.0334473 11.684 0.368719 11.0533 0.969757C10.7458 1.27699 10.5018 1.64181 10.3354 2.04336C10.169 2.44492 10.0833 2.87533 10.0833 3.31001C10.0833 3.74468 10.169 4.1751 10.3354 4.57665C10.5018 4.9782 10.7458 5.34302 11.0533 5.65026L13.0534 7.65042L7.65059 13.0533L5.64951 11.0531C5.01879 10.4521 4.18096 10.1168 3.30972 10.1168C2.43848 10.1168 1.60065 10.4521 0.969928 11.0531C0.66244 11.3603 0.418512 11.7251 0.252086 12.1267C0.0856608 12.5282 0 12.9587 0 13.3933C0 13.828 0.0856608 14.2584 0.252086 14.66C0.418512 15.0615 0.66244 15.4264 0.969928 15.7336L2.97009 17.7338L2.10201 18.6018C2.01446 18.6864 1.94463 18.7875 1.89659 18.8994C1.84854 19.0112 1.82326 19.1315 1.8222 19.2532C1.82114 19.3749 1.84433 19.4956 1.89043 19.6083C1.93652 19.721 2.00458 19.8233 2.09065 19.9094C2.17672 19.9954 2.27907 20.0635 2.39172 20.1096C2.50438 20.1557 2.62508 20.1789 2.7468 20.1778C2.86851 20.1768 2.9888 20.1515 3.10063 20.1034C3.21247 20.0554 3.31362 19.9856 3.39818 19.898L4.26626 19.0299L6.26734 21.0301C6.57456 21.3374 6.93932 21.5813 7.34079 21.7476C7.74226 21.9139 8.17257 21.9996 8.60714 21.9996C9.0417 21.9996 9.47201 21.9139 9.87348 21.7476C10.2749 21.5813 10.6397 21.3374 10.9469 21.0301C11.2544 20.7229 11.4983 20.3582 11.6647 19.9567C11.8311 19.5552 11.9168 19.1249 11.9168 18.6903C11.9168 18.2557 11.8311 17.8254 11.6647 17.4239C11.4983 17.0224 11.2544 16.6577 10.9469 16.3505L8.94676 14.3503L14.3551 8.94659L16.3553 10.9468C16.6625 11.2541 17.0272 11.4979 17.4287 11.6643C17.8302 11.8306 18.2605 11.9162 18.6951 11.9162C19.1296 11.9162 19.5599 11.8306 19.9614 11.6643C20.3629 11.4979 20.7276 11.2541 21.0348 10.9468C21.3423 10.6396 21.5862 10.2749 21.7526 9.87338C21.919 9.4719 22.0047 9.04156 22.0047 8.60696C22.0047 8.17236 21.919 7.74203 21.7526 7.34055C21.5862 6.93907 21.3423 6.57433 21.0348 6.26717H21.0303ZM10.0834 18.6908C10.0838 18.8846 10.0458 19.0766 9.97152 19.2557C9.89726 19.4347 9.78824 19.5973 9.65076 19.7339C9.36979 20.0027 8.99596 20.1527 8.60714 20.1527C8.21831 20.1527 7.84448 20.0027 7.56351 19.7339L2.26609 14.4365C1.98931 14.1597 1.83381 13.7843 1.83381 13.3929C1.83381 13.0014 1.98931 12.626 2.26609 12.3493C2.54288 12.0725 2.91828 11.917 3.30972 11.917C3.70116 11.917 4.07656 12.0725 4.35334 12.3493L9.65076 17.6467C9.78835 17.7834 9.89743 17.9461 9.9717 18.1254C10.046 18.3046 10.0839 18.4968 10.0834 18.6908ZM19.7341 9.65059C19.4531 9.91937 19.0793 10.0694 18.6905 10.0694C18.3016 10.0694 17.9278 9.91937 17.6468 9.65059L12.3494 4.35317C12.2124 4.21612 12.1037 4.05342 12.0295 3.87435C11.9553 3.69529 11.9171 3.50337 11.9171 3.30955C11.9171 2.91811 12.0726 2.54271 12.3494 2.26592C12.6262 1.98914 13.0016 1.83364 13.3931 1.83364C13.7845 1.83364 14.1599 1.98914 14.4367 2.26592L19.7341 7.56334C19.8713 7.70032 19.9801 7.86301 20.0543 8.04208C20.1286 8.22115 20.1668 8.41311 20.1668 8.60696C20.1668 8.80082 20.1286 8.99277 20.0543 9.17185C19.9801 9.35092 19.8713 9.51361 19.7341 9.65059V9.65059Z" fill="#06B6D4"></path></g><defs><clipPath id="clip0_47_1602"><rect width="22" height="22" fill="white"></rect></clipPath></defs></svg>
                        Фитнес
                    </button>
                    <button class="tablink-library" onclick="promptsBlock(6)" style="background-color: #262119; color: #F59E0B">
                        <svg class="svgPath" width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_47_1606)"><path d="M21.0832 14.6669C20.84 14.6669 20.6069 14.7635 20.435 14.9354C20.2631 15.1073 20.1665 15.3405 20.1665 15.5836V17.4169C20.1665 18.1463 19.8768 18.8457 19.361 19.3615C18.8453 19.8772 18.1458 20.1669 17.4165 20.1669H15.5832C15.3401 20.1669 15.1069 20.2635 14.935 20.4354C14.7631 20.6073 14.6665 20.8405 14.6665 21.0836C14.6665 21.3267 14.7631 21.5599 14.935 21.7318C15.1069 21.9037 15.3401 22.0003 15.5832 22.0003H17.4165C18.6316 21.9988 19.7966 21.5154 20.6558 20.6562C21.515 19.797 21.9984 18.6321 21.9998 17.4169V15.5836C21.9998 15.3405 21.9032 15.1073 21.7313 14.9354C21.5594 14.7635 21.3263 14.6669 21.0832 14.6669Z" fill="#F59E0B"></path><path d="M0.916667 7.33333C1.15978 7.33333 1.39294 7.23676 1.56485 7.06485C1.73676 6.89294 1.83333 6.65978 1.83333 6.41667V4.58333C1.83333 3.85399 2.12306 3.15451 2.63879 2.63879C3.15451 2.12306 3.85399 1.83333 4.58333 1.83333H6.41667C6.65978 1.83333 6.89294 1.73676 7.06485 1.56485C7.23676 1.39294 7.33333 1.15978 7.33333 0.916667C7.33333 0.673552 7.23676 0.440394 7.06485 0.268485C6.89294 0.0965771 6.65978 0 6.41667 0L4.58333 0C3.3682 0.00145554 2.20326 0.484808 1.34403 1.34403C0.484808 2.20326 0.00145554 3.3682 0 4.58333L0 6.41667C0 6.65978 0.0965771 6.89294 0.268485 7.06485C0.440394 7.23676 0.673552 7.33333 0.916667 7.33333Z" fill="#F59E0B"></path><path d="M6.41667 20.1669H4.58333C3.85399 20.1669 3.15451 19.8772 2.63879 19.3615C2.12306 18.8457 1.83333 18.1463 1.83333 17.4169V15.5836C1.83333 15.3405 1.73676 15.1073 1.56485 14.9354C1.39294 14.7635 1.15978 14.6669 0.916667 14.6669C0.673552 14.6669 0.440394 14.7635 0.268485 14.9354C0.0965771 15.1073 0 15.3405 0 15.5836L0 17.4169C0.00145554 18.6321 0.484808 19.797 1.34403 20.6562C2.20326 21.5154 3.3682 21.9988 4.58333 22.0003H6.41667C6.65978 22.0003 6.89294 21.9037 7.06485 21.7318C7.23676 21.5599 7.33333 21.3267 7.33333 21.0836C7.33333 20.8405 7.23676 20.6073 7.06485 20.4354C6.89294 20.2635 6.65978 20.1669 6.41667 20.1669Z" fill="#F59E0B"></path><path d="M17.4165 0H15.5832C15.3401 0 15.1069 0.0965771 14.935 0.268485C14.7631 0.440394 14.6665 0.673552 14.6665 0.916667C14.6665 1.15978 14.7631 1.39294 14.935 1.56485C15.1069 1.73676 15.3401 1.83333 15.5832 1.83333H17.4165C18.1458 1.83333 18.8453 2.12306 19.361 2.63879C19.8768 3.15451 20.1665 3.85399 20.1665 4.58333V6.41667C20.1665 6.65978 20.2631 6.89294 20.435 7.06485C20.6069 7.23676 20.84 7.33333 21.0832 7.33333C21.3263 7.33333 21.5594 7.23676 21.7313 7.06485C21.9032 6.89294 21.9998 6.65978 21.9998 6.41667V4.58333C21.9984 3.3682 21.515 2.20326 20.6558 1.34403C19.7966 0.484808 18.6316 0.00145554 17.4165 0V0Z" fill="#F59E0B"></path><path d="M11.0002 10.0833C11.7254 10.0833 12.4343 9.86823 13.0373 9.46533C13.6402 9.06243 14.1102 8.48978 14.3877 7.81978C14.6652 7.14978 14.7379 6.41254 14.5964 5.70128C14.4549 4.99001 14.1057 4.33667 13.5929 3.82388C13.0801 3.31109 12.4268 2.96187 11.7155 2.82039C11.0042 2.67892 10.267 2.75153 9.59699 3.02905C8.92699 3.30657 8.35434 3.77654 7.95144 4.37952C7.54854 4.9825 7.3335 5.69141 7.3335 6.41661C7.3335 7.38907 7.7198 8.3217 8.40744 9.00933C9.09507 9.69697 10.0277 10.0833 11.0002 10.0833ZM11.0002 4.58327C11.3628 4.58327 11.7172 4.6908 12.0187 4.89225C12.3202 5.0937 12.5552 5.38002 12.6939 5.71502C12.8327 6.05002 12.869 6.41864 12.7983 6.77427C12.7275 7.1299 12.5529 7.45657 12.2965 7.71297C12.0401 7.96937 11.7135 8.14397 11.3578 8.21471C11.0022 8.28545 10.6336 8.24915 10.2986 8.11039C9.96358 7.97163 9.67725 7.73664 9.4758 7.43515C9.27435 7.13366 9.16683 6.77921 9.16683 6.41661C9.16683 5.93038 9.35998 5.46406 9.7038 5.12024C10.0476 4.77643 10.5139 4.58327 11.0002 4.58327Z" fill="#F59E0B"></path><path d="M16.5002 18.3336C16.7433 18.3336 16.9764 18.237 17.1483 18.0651C17.3203 17.8932 17.4168 17.66 17.4168 17.4169C17.4154 15.9587 16.8354 14.5606 15.8043 13.5295C14.7732 12.4983 13.3751 11.9184 11.9168 11.9169H10.0835C8.62525 11.9184 7.22715 12.4983 6.19602 13.5295C5.16488 14.5606 4.58495 15.9587 4.5835 17.4169C4.5835 17.66 4.68007 17.8932 4.85198 18.0651C5.02389 18.237 5.25705 18.3336 5.50016 18.3336C5.74328 18.3336 5.97644 18.237 6.14834 18.0651C6.32025 17.8932 6.41683 17.66 6.41683 17.4169C6.41683 16.4445 6.80314 15.5118 7.49077 14.8242C8.1784 14.1366 9.11104 13.7503 10.0835 13.7503H11.9168C12.8893 13.7503 13.8219 14.1366 14.5096 14.8242C15.1972 15.5118 15.5835 16.4445 15.5835 17.4169C15.5835 17.66 15.6801 17.8932 15.852 18.0651C16.0239 18.237 16.257 18.3336 16.5002 18.3336Z" fill="#F59E0B"></path></g><defs><clipPath id="clip0_47_1606"><rect width="22" height="22" fill="white"></rect></clipPath></defs></svg>
                        Фотография
                    </button>
                    <button class="tablink-library" onclick="promptsBlock(7)" style="background-color: #101525; color: #2E49D8">
                        <svg class="svgPath" width="22" height="22" viewBox="0 0 22 22" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_47_1609)"><path d="M21.5738 13.4984C21.384 13.2678 21.1404 13.0874 20.8645 12.9729C20.5887 12.8585 20.2889 12.8135 19.9916 12.842C18.3945 12.9683 16.8442 13.4421 15.4494 14.2303C14.0546 15.0186 12.8489 16.1021 11.9167 17.4052V12.7513C13.1969 12.5338 14.359 11.8708 15.1977 10.8795C16.0363 9.88813 16.4976 8.63227 16.5001 7.33377C16.5001 4.77352 14.719 2.6111 12.9764 0.833683C12.4481 0.317458 11.7387 0.0284424 11.0001 0.0284424C10.2614 0.0284424 9.55205 0.317458 9.02372 0.833683C7.28114 2.6111 5.50005 4.77352 5.50005 7.33377C5.50246 8.63227 5.96377 9.88813 6.80245 10.8795C7.64114 11.8708 8.80322 12.5338 10.0834 12.7513V17.4052C9.15124 16.1021 7.94555 15.0186 6.55072 14.2303C5.15588 13.4421 3.60563 12.9683 2.00847 12.842C1.71118 12.8137 1.41149 12.8587 1.13565 12.9732C0.859813 13.0876 0.616249 13.2679 0.426303 13.4984C0.237573 13.7224 0.106166 13.989 0.0434066 14.2752C-0.0193524 14.5614 -0.0115804 14.8585 0.0660528 15.141C1.93514 21.8675 10.6251 22.0004 10.9946 22.0004H11.0056C11.3722 22.0004 20.0659 21.8675 21.935 15.141C22.0122 14.8584 22.0196 14.5613 21.9567 14.2752C21.8938 13.9891 21.7624 13.7225 21.5738 13.4984V13.4984ZM7.33339 7.33377C7.33339 4.90093 10.3749 2.09135 10.3932 2.07577C10.0586 2.93377 7.96864 8.15877 10.0834 8.25043C10.3265 8.25043 10.5597 8.15386 10.7316 7.98195C10.9035 7.81004 11.0001 7.57688 11.0001 7.33377C11.0693 5.70342 11.4609 4.10294 12.1523 2.62485C13.4641 4.02735 14.6667 5.6416 14.6667 7.33377C14.6667 8.30623 14.2804 9.23886 13.5928 9.92649C12.9051 10.6141 11.9725 11.0004 11.0001 11.0004C10.0276 11.0004 9.09496 10.6141 8.40733 9.92649C7.71969 9.23886 7.33339 8.30623 7.33339 7.33377V7.33377ZM1.83889 14.6671C3.49048 14.8009 5.07748 15.3683 6.4395 16.312C7.80152 17.2557 8.89027 18.5422 9.59572 20.0415C7.3068 19.7244 2.93339 18.6088 1.83889 14.6671ZM12.4163 20.0397C13.1275 18.5446 14.2166 17.2609 15.5758 16.3156C16.9351 15.3703 18.5175 14.7961 20.1667 14.6497C19.0722 18.5932 14.7089 19.7189 12.4163 20.0397Z" fill="#2E49D8"></path></g><defs><clipPath id="clip0_47_1609"><rect width="22" height="22" fill="white"></rect></clipPath></defs></svg>
                        Красота
                    </button>
                </div>
                <div class="prompts-in-category">
                    <div class="prompt-category">
                        <span>
                            При жарке мяса не используйте вилки - они прокалывают его и вытаскивают соки. Вместо этого используйте щипцы.
                        </span>
                        <div class="hoverItems prompts">
                            <button class="choosePrompt">
                                <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_16_2165)"><path d="M6.29239 10.4166C6.139 10.4167 5.98709 10.3866 5.84535 10.3279C5.70362 10.2693 5.57484 10.1833 5.46639 10.0748L3.25906 7.91703C3.14844 7.80873 3.08537 7.66093 3.08373 7.50613C3.08209 7.35134 3.14201 7.20223 3.25031 7.09161C3.3586 6.98099 3.50641 6.91793 3.6612 6.91629C3.816 6.91465 3.96511 6.97456 4.07572 7.08286L6.28831 9.24528L10.2585 5.33694C10.3704 5.23843 10.5159 5.18654 10.6649 5.19193C10.8139 5.19732 10.9552 5.25959 11.0598 5.36593C11.1643 5.47227 11.2242 5.61461 11.227 5.76371C11.2299 5.91281 11.1755 6.05734 11.0751 6.16761L7.11256 10.08C7.0047 10.1873 6.87673 10.2723 6.736 10.33C6.59526 10.3878 6.44452 10.4172 6.29239 10.4166ZM14.1674 11.5833V7.69828C14.1891 5.90012 13.5299 4.1603 12.3219 2.82813C11.114 1.49596 9.44676 0.670065 7.65506 0.516277C6.65502 0.44631 5.65162 0.591958 4.71274 0.943366C3.77387 1.29477 2.92143 1.84374 2.21309 2.55313C1.50475 3.26252 0.957048 4.11577 0.607033 5.05517C0.257018 5.99456 0.112857 6.99818 0.184306 7.99811C0.442139 11.7046 3.71522 14.4999 7.79914 14.4999H11.2507C12.024 14.499 12.7653 14.1914 13.3121 13.6446C13.8589 13.0979 14.1665 12.3565 14.1674 11.5833ZM7.57572 1.68061C9.07282 1.81305 10.4643 2.50714 11.4707 3.62343C12.477 4.73973 13.0237 6.19551 13.0007 7.69828V11.5833C13.0007 12.0474 12.8163 12.4925 12.4882 12.8207C12.16 13.1489 11.7149 13.3333 11.2507 13.3333H7.79914C4.27931 13.3333 1.56739 11.0583 1.34864 7.91761C1.29121 7.11762 1.39937 6.31437 1.66637 5.55807C1.93337 4.80176 2.35346 4.10864 2.90041 3.522C3.44735 2.93537 4.1094 2.46783 4.84518 2.14859C5.58096 1.82935 6.37467 1.66527 7.17672 1.66661C7.30914 1.66661 7.44272 1.67186 7.57572 1.68061Z" fill="white"/></g><defs><clipPath id="clip0_16_2165"><rect width="14" height="14" fill="white" transform="translate(0.16748 0.5)"/></clipPath></defs></svg>
                                {{__('choosePrompt')}}
                            </button>
                        </div>
                    </div>
                </div>
                <div class="closeBtnBuy">
                    <button>
                        <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_73_1622)"><path d="M12.0001 6.00009C11.8594 5.85949 11.6687 5.7805 11.4698 5.7805C11.271 5.7805 11.0802 5.85949 10.9396 6.00009L9.00008 7.93959L7.06058 6.00009C6.91913 5.86347 6.72968 5.78788 6.53303 5.78959C6.33639 5.7913 6.14828 5.87017 6.00922 6.00923C5.87016 6.14828 5.79129 6.33639 5.78958 6.53304C5.78787 6.72969 5.86347 6.91914 6.00008 7.06059L7.93958 9.00009L6.00008 10.9396C5.86347 11.081 5.78787 11.2705 5.78958 11.4671C5.79129 11.6638 5.87016 11.8519 6.00922 11.991C6.14828 12.13 6.33639 12.2089 6.53303 12.2106C6.72968 12.2123 6.91913 12.1367 7.06058 12.0001L9.00008 10.0606L10.9396 12.0001C11.081 12.1367 11.2705 12.2123 11.4671 12.2106C11.6638 12.2089 11.8519 12.13 11.9909 11.991C12.13 11.8519 12.2089 11.6638 12.2106 11.4671C12.2123 11.2705 12.1367 11.081 12.0001 10.9396L10.0606 9.00009L12.0001 7.06059C12.1407 6.91995 12.2197 6.72922 12.2197 6.53034C12.2197 6.33147 12.1407 6.14074 12.0001 6.00009Z" fill="white"/><path d="M9 0C7.21997 0 5.47991 0.527841 3.99987 1.51677C2.51983 2.50571 1.36628 3.91131 0.685088 5.55585C0.00389957 7.20038 -0.17433 9.00998 0.172937 10.7558C0.520204 12.5016 1.37737 14.1053 2.63604 15.364C3.89472 16.6226 5.49836 17.4798 7.24419 17.8271C8.99002 18.1743 10.7996 17.9961 12.4442 17.3149C14.0887 16.6337 15.4943 15.4802 16.4832 14.0001C17.4722 12.5201 18 10.78 18 9C17.9974 6.61384 17.0484 4.32616 15.3611 2.63889C13.6738 0.951621 11.3862 0.00258081 9 0V0ZM9 16.5C7.51664 16.5 6.0666 16.0601 4.83323 15.236C3.59986 14.4119 2.63856 13.2406 2.07091 11.8701C1.50325 10.4997 1.35473 8.99168 1.64411 7.53682C1.9335 6.08197 2.64781 4.74559 3.6967 3.6967C4.7456 2.64781 6.08197 1.9335 7.53683 1.64411C8.99168 1.35472 10.4997 1.50325 11.8701 2.0709C13.2406 2.63856 14.4119 3.59985 15.236 4.83322C16.0601 6.06659 16.5 7.51664 16.5 9C16.4978 10.9885 15.7069 12.8948 14.3009 14.3009C12.8948 15.7069 10.9885 16.4978 9 16.5V16.5Z" fill="white"/></g><defs><clipPath id="clip0_73_1622"><rect width="18" height="18" fill="white"/></clipPath></defs></svg>
                    </button>
                </div>
            </div>
        </div>
    </div>
    @include('components.popups.popup-about')
    @include('components.popups.popup-develop')
    <div class="loaderResponse" id="loaderResponse">
        <div class="firstRow">
            <div class="loaderGif">

            </div>
            <div class="responseStat">
                <p>Meta GPT обрабатывает ваш запрос</p>
                <span>Дождитесь ответа</span>
            </div>
        </div>
        <!-- Остановить запрос
        <div class="secondRow">
            <button id="responseStop">
                <svg width="10" height="11" viewBox="0 0 10 11" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_17_1429)"><path d="M9.87819 0.622361C9.80006 0.544248 9.6941 0.500366 9.58361 0.500366C9.47313 0.500366 9.36716 0.544248 9.28903 0.622361L5.00028 4.91111L0.711527 0.622361C0.633391 0.544248 0.527429 0.500366 0.416944 0.500366C0.306459 0.500366 0.200497 0.544248 0.122361 0.622361C0.0442476 0.700497 0.000366211 0.806459 0.000366211 0.916944C0.000366211 1.02743 0.0442476 1.13339 0.122361 1.21153L4.41111 5.50028L0.122361 9.78903C0.0442476 9.86716 0.000366211 9.97313 0.000366211 10.0836C0.000366211 10.1941 0.0442476 10.3001 0.122361 10.3782C0.200497 10.4563 0.306459 10.5002 0.416944 10.5002C0.527429 10.5002 0.633391 10.4563 0.711527 10.3782L5.00028 6.08944L9.28903 10.3782C9.36716 10.4563 9.47313 10.5002 9.58361 10.5002C9.6941 10.5002 9.80006 10.4563 9.87819 10.3782C9.95631 10.3001 10.0002 10.1941 10.0002 10.0836C10.0002 9.97313 9.95631 9.86716 9.87819 9.78903L5.58944 5.50028L9.87819 1.21153C9.95631 1.13339 10.0002 1.02743 10.0002 0.916944C10.0002 0.806459 9.95631 0.700497 9.87819 0.622361Z" fill="white"/></g><defs><clipPath id="clip0_17_1429"><rect width="10" height="10" fill="white" transform="translate(0 0.5)"/></clipPath></defs></svg>
            </button>
        </div>
        -->
    </div>
    <!--Slick Slider-->
    <script type="text/javascript" src="//code.jquery.com/jquery-1.11.0.min.js"></script>
    <script type="text/javascript" src="//code.jquery.com/jquery-migrate-1.2.1.min.js"></script>
    <!--ShowDown
    <script src="https://cdn.jsdelivr.net/npm/marked/marked.min.js"></script>
    -->
    <script src=" https://cdn.jsdelivr.net/npm/markdown-it@13.0.1/dist/markdown-it.min.js "></script>
    <script src="https://cdnjs.cloudflare.com/ajax/libs/slick-carousel/1.8.1/slick.min.js" integrity="sha512-XtmMtDEcNz2j7ekrtHvOVR4iwwaD6o/FUJe6+Zq+HgcCsk3kj4uSQQR8weQ2QVj1o0Pk6PwYLohm206ZzNfubg==" crossorigin="anonymous" referrerpolicy="no-referrer"></script>
    {{--Код для добавления чата--}}
    <script>
        function add_new_chat(form) {
            console.log(form)
            let key = form.querySelector('input[name=_token]').value;
            let dataInput = {}
            if (form.classList.contains('folder__chat')) {
                dataInput = {
                    'folder_id': form.querySelector('.folder_id').value
                }
            }
            fetch(form.action, {headers: {'Content-Type': 'application/json;charset=utf-8', "X-CSRF-Token": key}, method: 'POST', body: JSON.stringify(dataInput)}).then(
                response => response.text(),
            ).then(async data => {
                $('.tablinks-container').load('/chat_sidebar/' + {{ $chat->id }});
                initDelete();
                setTimeout(function () {
                    openFolder()
                    document.querySelector(`.tablink[data-id="${JSON.parse(data)['id']}"]`).click()
                }, 500)
            })

        }
    </script>

    {{-- Код для смены названия чата --}}
    <script>
    document.querySelectorAll('.chat__update-form').forEach(item => {
        item.addEventListener('submit', function (e) {
            e.preventDefault()
            fetch(item.action, {
                headers: {
                    'Content-Type': 'application/json;charset=utf-8',
                    "X-CSRF-Token": $(item).find('input[name="_token"]').val()
                }, method: "PATCH", body: JSON.stringify({'title': item.querySelector('input[name="title"]').value})
            })
            item.parentElement.parentElement.querySelector('.chat__name').innerHTML = item.querySelector('input[name="title"]').value
            renameChat(item.parentElement.parentElement.querySelector("button.renameChat"))
        })
    })
    </script>

    {{-- Код для смены названия папки --}}
    <script>
        function renFolder(item) {
            let form = item.parentElement.parentElement.parentElement.parentElement.querySelector('.chat__update-form');
            fetch(form.action, {headers: {'Content-Type': 'application/json;charset=utf-8', "X-CSRF-Token": form.querySelector('input[name="_token"]').value}, method: "PATCH", body: JSON.stringify({'title': form.querySelector('#renameFolderInput').value})})
            form.parentElement.querySelector('.folderName').innerHTML = form.querySelector('#renameFolderInput').value
            renameFolder(item)
        }
    </script>

    {{-- Код для удаления чата --}}
    <script>
        function delChat(item) {
            item.parentElement.parentElement.parentElement.remove()
            if (document.querySelector('.tablink')) {
                document.querySelector('.tablink').click()
            } else {
                window.location.replace('/')
            }
            fetch(item.action, {headers: {'Content-Type': 'application/json;charset=utf-8', "X-CSRF-Token": $(item).find('input[name="_token"]').val()}, method: "DELETE"})
        }
    </script>

    {{-- Код для удаления папки --}}
    <script>
        function delFolder(item) {
            item.addEventListener('submit', function(e) {
                e.preventDefault()
                this.parentElement.parentElement.parentElement.parentElement.parentElement.remove()
                if (document.querySelector('.tablink')) {
                    document.querySelector('.tablink').click()
                } else {
                    window.location.replace('/')
                }
                fetch(this.action, {headers: {'Content-Type': 'application/json;charset=utf-8', "X-CSRF-Token": $(this).find('input[name="_token"]').val()}, method: "DELETE"})
            })
        }
    </script>

    {{-- Код для смены системной роли --}}
    <script>
        function changeRole(item) {
            item.preventDefault()
            let form = item.target
            fetch(form.action, {headers: {'Content-Type': 'application/json;charset=utf-8', "X-CSRF-Token": form.querySelector('input[name="_token"]').value}, method: "POST", body: JSON.stringify({'role': form.querySelector('#systemRoleText').value})})
            document.querySelector('.systemRole button.renameChat').click()
            document.querySelector('.systemRole span').textContent = form.querySelector('#systemRoleText').value;
            document.querySelector('.systemRole span').classList.remove('display-none');
        }
    </script>

    <script>
        //Открытие попапа библиотеки подсказок
        document.getElementById('openPrompts').onclick = () =>{
            document.getElementById('popup-library').classList.add('active');
            closePopContainer('popup-library', '#popup-library .popupContent');
        }
    </script>

    <script src="{{ asset('js/script.js') }}"></script>
    <script>
        $('.prompts-category').slick({
          infinite: false,
          slidesToShow: 4,
          slidesToScroll: 1
        });
    </script>
    <script>
        //Кнопка "Выбрать" в попапе библиотеки подсказок
        let choosePrompts = document.querySelectorAll('button.choosePrompt');
        choosePrompts.forEach((item)=>{
            item.onclick = () =>{
                document.querySelector('textarea.msger-input').value = String(item.parentElement.parentElement.querySelector('span').innerText).trim();
                document.getElementById('popup-library').classList.remove('active');
            }
        })
    </script>
    <script>
        //Закрытие попапов
        let closeBtnBuy =  document.querySelectorAll('.closeBtnBuy button');

        closeBtnBuy.forEach((item)=>{
            let popups = document.querySelectorAll('.popup');
            item.onclick = () =>{
                popups.forEach(
                    (item)=>{
                        item.classList.remove('active');
                        if(item.id == "pay-popup"){
                            document.getElementById('tokensLeft').classList.remove('active');
                        }
                    }
                );
            }
        })
    </script>
    <script>
        //Редактирование профиля
        let editProfile = document.querySelectorAll('.coolInput .hoverItems button.rename-profile'),
        editProfileInput = document.querySelectorAll('.coolInput .input-span input'),
        editProfileP = document.querySelectorAll('.coolInput .input-span p'),
        editProfileConfirm = document.querySelectorAll('.coolInput .hoverItems .rename-confirm'),
        editProfileHoverItems = document.querySelectorAll('.coolInput .hoverItems');

        for(let i = 0; editProfile.length > i; i++){
            editProfile[i].onclick = () =>{
                editProfile.forEach(item => item.classList.remove('nonActive'));
                editProfileHoverItems.forEach(item=>item.classList.remove('active'));
                editProfileConfirm.forEach(item=>item.classList.add('nonActive'));
                editProfileInput.forEach(item=>item.classList.add('nonActive'));
                editProfileP.forEach(item=>item.classList.remove('nonActive'));
                //Скрипт
                editProfile[i].classList.add('nonActive');
                editProfileHoverItems[i].classList.add('active');
                editProfileConfirm[i].classList.remove('nonActive');
                editProfileInput[i].classList.remove('nonActive');
                editProfileInput[i].value = String(editProfileP[i].innerText).trim();
                editProfileP[i].classList.add('nonActive');
                //да (вешаем обработчики)
                editProfileConfirm[i].querySelector('button.renameProfileYes').onclick = () =>{

                }
                //Нет
                editProfileConfirm[i].querySelector('button.renameProfileNo').onclick = () =>{
                    editProfile[i].classList.remove('nonActive');
                    editProfileHoverItems[i].classList.remove('active');
                    editProfileConfirm[i].classList.add('nonActive');
                    editProfileInput[i].classList.add('nonActive');
                    editProfileP[i].classList.remove('nonActive');
                }
            }
        }
    </script>
    <script>
        function hideButtonScroll(elem) {
            if($(elem).scrollTop() + 1000 > elem.scrollHeight) {
                $('#scrollBottomBtn').hide();
            } else {
                $('#scrollBottomBtn').show();
            }
        }
        document.addEventListener('DOMContentLoaded', function () {
            if (document.querySelector('.msger-chat').clientHeight < document.querySelector('.msger-chat').scrollHeight) {
                hideButtonScroll(document.querySelector('.msger-chat'))
                document.querySelector('.msger-chat').addEventListener('scroll', function () {
                    hideButtonScroll(this)
                })
                $('#scrollBottomBtn').click(function(){
                    $(".msger-chat").animate({
                        scrollTop: $('.msger-chat')[0].scrollHeight
                    }, 800);
                    return false;
                });
            } else {
                $('#scrollBottomBtn').hide();
            }
        })

    </script>
    <script>
        function promptsBlock(id) {
            $('.prompts-in-category').load(`/prompts/${id}/main/0`);
            setTimeout(()=>{
                document.querySelectorAll('.prompts-in-category button.copyRole').forEach((item)=>{
                    item.innerHTML = `
                    <svg width="15" height="15" viewBox="0 0 15 15" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_16_2165)"><path d="M6.29239 10.4166C6.139 10.4167 5.98709 10.3866 5.84535 10.3279C5.70362 10.2693 5.57484 10.1833 5.46639 10.0748L3.25906 7.91703C3.14844 7.80873 3.08537 7.66093 3.08373 7.50613C3.08209 7.35134 3.14201 7.20223 3.25031 7.09161C3.3586 6.98099 3.50641 6.91793 3.6612 6.91629C3.816 6.91465 3.96511 6.97456 4.07572 7.08286L6.28831 9.24528L10.2585 5.33694C10.3704 5.23843 10.5159 5.18654 10.6649 5.19193C10.8139 5.19732 10.9552 5.25959 11.0598 5.36593C11.1643 5.47227 11.2242 5.61461 11.227 5.76371C11.2299 5.91281 11.1755 6.05734 11.0751 6.16761L7.11256 10.08C7.0047 10.1873 6.87673 10.2723 6.736 10.33C6.59526 10.3878 6.44452 10.4172 6.29239 10.4166ZM14.1674 11.5833V7.69828C14.1891 5.90012 13.5299 4.1603 12.3219 2.82813C11.114 1.49596 9.44676 0.670065 7.65506 0.516277C6.65502 0.44631 5.65162 0.591958 4.71274 0.943366C3.77387 1.29477 2.92143 1.84374 2.21309 2.55313C1.50475 3.26252 0.957048 4.11577 0.607033 5.05517C0.257018 5.99456 0.112857 6.99818 0.184306 7.99811C0.442139 11.7046 3.71522 14.4999 7.79914 14.4999H11.2507C12.024 14.499 12.7653 14.1914 13.3121 13.6446C13.8589 13.0979 14.1665 12.3565 14.1674 11.5833ZM7.57572 1.68061C9.07282 1.81305 10.4643 2.50714 11.4707 3.62343C12.477 4.73973 13.0237 6.19551 13.0007 7.69828V11.5833C13.0007 12.0474 12.8163 12.4925 12.4882 12.8207C12.16 13.1489 11.7149 13.3333 11.2507 13.3333H7.79914C4.27931 13.3333 1.56739 11.0583 1.34864 7.91761C1.29121 7.11762 1.39937 6.31437 1.66637 5.55807C1.93337 4.80176 2.35346 4.10864 2.90041 3.522C3.44735 2.93537 4.1094 2.46783 4.84518 2.14859C5.58096 1.82935 6.37467 1.66527 7.17672 1.66661C7.30914 1.66661 7.44272 1.67186 7.57572 1.68061Z" fill="white"/></g><defs><clipPath id="clip0_16_2165"><rect width="14" height="14" fill="white" transform="translate(0.16748 0.5)"/></clipPath></defs></svg>
                    Выбрать
                    `
                    item.onclick = () =>{
                        document.querySelector('textarea.msger-input').value = String(item.parentElement.parentElement.querySelector('span').innerText).trim();
                        document.getElementById('popup-library').classList.remove('active');
                    }
                })
            }, 300)
        }

        function myFunction(id) {
            $.each($('.tablink'), function (index, val) {
                val.classList.remove('active')
            })
            event.target.classList.add('active');
            $('.msger-chat').load(`/messages/get/${id}`);

            let stateObj = { id: "100" };
            window.history.replaceState(stateObj,
                "Page 3", `/chats/${id}`);
            $('#chat_id').val(id);
            $.each($('.tablink'), function (index, val) {
                val.classList.remove('active')
            })
            event.target.classList.add('active');
            $(".msger-chat").scrollTop($(".msger-chat")[0].scrollHeight);

            $('.sidebarMain.right').load(`/chat/role/${id}`)
            $('.tokensSpent').load(`/messages-cost/get/${id}`);
        }
    </script>
@endsection
