app/Http/Controllers/Chat/ChatController.php

select * from "chats" where "user_id" = 1
select * from "messages" where "chat_id" = 1 order by "id" asc
---
    public function show(Chat $chat)
    {
        $history = BuyHistory::where('user_id', Auth::id())->get();
        $purchases = Purchace::all();
        $chats = Chat::whereNull('folder_id')->where('user_id', Auth::id())->orderByDesc("id")->get()->sortBy("id");
        $folders = (new Folder())->getFolders();
        $messages = Message::where('chat_id', $chat->id)->orderByDesc("id")->get()->sortBy("id");