app/Http/Controllers/Chat/ChatController.php

    public function index()
    {
        if ($chat = Chat::where('user_id', Auth::id())->first()) return redirect()->route('chats.show', $chat->id);
---
select * from "chats" where "user_id" = 1

    public function store(Request $request)
    {
        $chat = Chat::create([
            'user_id' => Auth::id()
        ]);
---
insert into "chats" ("user_id", "updated_at", "created_at") values (1, '2023-04-14 16:30:02', '2023-04-14 16:30:02') returning "id"

    public function show(Chat $chat)
    {
        $chats = Chat::whereNull('folder_id')->where('user_id', Auth::id())->get()->sortBy("id");
        $folders = Folder::with('children')->get();
---
select * from "chats" where "folder_id" is null and "user_id" = 1
select * from "folders"