    <!--Попап "О проекте"-->
    <div class="popup" id="about-popup">
        <div class="popupContent">
            <div class="popup-inner">
                <h2>О проекте MetaGPT</h2>
                <div class="about-project-inner">
                    <p>
                        Добро пожаловать в MetaGPT. Наш сервис предоставляет доступ к использованию chatGPT - самой передовой технологии генерации текста на сегодняшний день. Наш проект создан для того, чтобы помочь людям в их повседневной жизни, предоставляя удобный и простой интерфейс для общения с моделью.
                    </p>
                    <p>
                        Основная цель нашего проекта - предоставить доступ всем желающим к удобному использованию chatGPT. Мы понимаем, что не каждый пользователь может быть экспертом в области искусственного интеллекта, поэтому мы разработали библиотеку подсказок, которая поможет вам легко и быстро общаться с любой моделью GPT на различные темы, получая самый предсказуемый результат. Кроме того, мы предоставляем библиотеки ролей, которые позволяют задать роль модели в соответствии с вашими потребностями, тем самым продуктивность общения с GPT увеличивается в разы.
                    </p>
                    <p>
                        Мы уверены, что наш сервис стоит использовать, потому что мы сочетаем самые нужные функции и инструменты для обещания с GPT в одном месте. Именно такой подход поможет вам получить быстрый и точный ответ на любой вопрос. Наша библиотека подсказок и ролей облегчает процесс общения с моделью, что делает наш сервис идеальным выбором для всех, кто ищет быстрый и удобный способ использования продуктивного chatGPT
                    </p>
                </div>
                <div class="about-project-soc">
                    <a href="https://t.me/meta_gpt" target="_blank">
                        <button>
                            <svg width="19" height="16" viewBox="0 0 19 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M18.5007 0.773993L15.653 15.1295C15.653 15.1295 15.2546 16.1248 14.16 15.6474L7.58973 10.6099L5.19989 9.45524L1.17801 8.10134C1.17801 8.10134 0.560826 7.88181 0.501451 7.40446C0.441295 6.92634 1.19833 6.66774 1.19833 6.66774L17.1866 0.395868C17.1866 0.395868 18.5007 -0.181476 18.5007 0.773993Z" fill="#FEFEFE"/><path d="M10.1559 12.8873L7.3582 15.4381C7.3582 15.4381 7.14023 15.6037 6.90039 15.4998C6.54805 15.449 5.51445 11.7646 4.87305 9.56618L5.40977 9.22478L10.1559 12.8873Z" fill="#B5D2E5"/><path d="M6.90039 15.4998C6.51914 15.4638 5.06914 10.2084 4.87305 9.56618L15.266 2.9654C15.8066 2.63727 16.0957 2.89586 15.6301 3.33024C15.309 3.63024 7.46602 10.6802 7.46602 10.6802L6.90039 15.4998Z" fill="#D3E7F2"/></svg>
                            Следите за новостями в Telegram
                        </button>
                    </a>
                    или
                    <a href="">
                        <button>
                            <svg width="19" height="16" viewBox="0 0 19 16" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M8.97266 4.29103V7.45508H16.3554V4.29103H8.97266ZM11.6372 10.5048C9.26165 9.9853 7.54012 7.64436 7.99522 5.03416C8.04261 4.75864 7.86546 4.49342 7.5925 4.43113C7.18772 4.33793 6.7644 4.29107 6.33595 4.29107C3.13791 4.29107 0.500041 6.89329 0.500041 10.0918C0.500041 11.1089 0.797848 12.1023 1.29738 12.9814L0.526794 15.2345C0.496014 15.3273 0.491659 15.4269 0.514215 15.522C0.536772 15.6171 0.58535 15.7041 0.654516 15.7732C0.796442 15.9144 1.00337 15.9636 1.19318 15.9009L3.44686 15.1298C4.32439 15.6294 5.31829 15.8925 6.33592 15.8925C9.14669 15.8925 11.5465 13.8825 12.044 11.113C12.0945 10.8339 11.9142 10.5651 11.6372 10.5048Z" fill="#9DE3FF"/><path d="M17.7055 8.76286C18.2011 7.88743 18.5 6.88548 18.5 5.87302C18.5 2.6773 15.8598 0.0722656 12.664 0.0722656C9.83749 0.0722656 7.44336 2.08668 6.95824 4.86049C6.89496 5.21912 6.86328 5.54607 6.86328 5.87302C6.86328 8.57301 8.77226 10.9566 11.409 11.5367C12.7695 11.8531 14.3093 11.6211 15.5539 10.9144L17.8039 11.6773C17.9726 11.7448 18.2029 11.705 18.3417 11.5507C18.4894 11.4136 18.5316 11.2026 18.4683 11.0128L17.7055 8.76286ZM10.5547 6.4004C10.2593 6.4004 10.0273 6.16834 10.0273 5.87306C10.0273 5.57771 10.2593 5.34572 10.5547 5.34572C10.85 5.34572 11.082 5.57771 11.082 5.87306C11.082 6.16834 10.85 6.4004 10.5547 6.4004ZM12.664 6.4004C12.3687 6.4004 12.1367 6.16834 12.1367 5.87306C12.1367 5.57771 12.3687 5.34572 12.664 5.34572C12.9594 5.34572 13.1914 5.57771 13.1914 5.87306C13.1914 6.16834 12.9594 6.4004 12.664 6.4004ZM14.7734 6.4004C14.4781 6.4004 14.2461 6.16834 14.2461 5.87306C14.2461 5.57771 14.4781 5.34572 14.7734 5.34572C15.0688 5.34572 15.3007 5.57771 15.3007 5.87306C15.3007 6.16834 15.0688 6.4004 14.7734 6.4004Z" fill="white"/></svg>
                            Присоединяйтесь к нашему чату
                        </button>
                    </a>
                </div>
                <div class="closeBtnBuy">
                    <button>
                        <svg width="18" height="18" viewBox="0 0 18 18" fill="none" xmlns="http://www.w3.org/2000/svg"><g clip-path="url(#clip0_73_1622)"><path d="M12.0001 6.00009C11.8594 5.85949 11.6687 5.7805 11.4698 5.7805C11.271 5.7805 11.0802 5.85949 10.9396 6.00009L9.00008 7.93959L7.06058 6.00009C6.91913 5.86347 6.72968 5.78788 6.53303 5.78959C6.33639 5.7913 6.14828 5.87017 6.00922 6.00923C5.87016 6.14828 5.79129 6.33639 5.78958 6.53304C5.78787 6.72969 5.86347 6.91914 6.00008 7.06059L7.93958 9.00009L6.00008 10.9396C5.86347 11.081 5.78787 11.2705 5.78958 11.4671C5.79129 11.6638 5.87016 11.8519 6.00922 11.991C6.14828 12.13 6.33639 12.2089 6.53303 12.2106C6.72968 12.2123 6.91913 12.1367 7.06058 12.0001L9.00008 10.0606L10.9396 12.0001C11.081 12.1367 11.2705 12.2123 11.4671 12.2106C11.6638 12.2089 11.8519 12.13 11.9909 11.991C12.13 11.8519 12.2089 11.6638 12.2106 11.4671C12.2123 11.2705 12.1367 11.081 12.0001 10.9396L10.0606 9.00009L12.0001 7.06059C12.1407 6.91995 12.2197 6.72922 12.2197 6.53034C12.2197 6.33147 12.1407 6.14074 12.0001 6.00009Z" fill="white"/><path d="M9 0C7.21997 0 5.47991 0.527841 3.99987 1.51677C2.51983 2.50571 1.36628 3.91131 0.685088 5.55585C0.00389957 7.20038 -0.17433 9.00998 0.172937 10.7558C0.520204 12.5016 1.37737 14.1053 2.63604 15.364C3.89472 16.6226 5.49836 17.4798 7.24419 17.8271C8.99002 18.1743 10.7996 17.9961 12.4442 17.3149C14.0887 16.6337 15.4943 15.4802 16.4832 14.0001C17.4722 12.5201 18 10.78 18 9C17.9974 6.61384 17.0484 4.32616 15.3611 2.63889C13.6738 0.951621 11.3862 0.00258081 9 0V0ZM9 16.5C7.51664 16.5 6.0666 16.0601 4.83323 15.236C3.59986 14.4119 2.63856 13.2406 2.07091 11.8701C1.50325 10.4997 1.35473 8.99168 1.64411 7.53682C1.9335 6.08197 2.64781 4.74559 3.6967 3.6967C4.7456 2.64781 6.08197 1.9335 7.53683 1.64411C8.99168 1.35472 10.4997 1.50325 11.8701 2.0709C13.2406 2.63856 14.4119 3.59985 15.236 4.83322C16.0601 6.06659 16.5 7.51664 16.5 9C16.4978 10.9885 15.7069 12.8948 14.3009 14.3009C12.8948 15.7069 10.9885 16.4978 9 16.5V16.5Z" fill="white"/></g><defs><clipPath id="clip0_73_1622"><rect width="18" height="18" fill="white"/></clipPath></defs></svg>
                    </button>
                </div>
            </div>
        </div>
    </div>